---
kind: type
id: T:Autodesk.Revit.DB.VerticalTextAlignment
source: html/07fa4c42-fe8b-4005-9e1d-9d035da44c8c.htm
---
# Autodesk.Revit.DB.VerticalTextAlignment

Supported types of vertical alignment of a text element.

## Syntax (C#)
```csharp
public enum VerticalTextAlignment
```